src/InformationRegisters/СостоянияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СостоянияКодовМаркировки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения номенклатурной позиции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировкиПолный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировкиУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКриптохвост</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУпаковокМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиМаркированнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящий</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭДПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Comment>Документ поступления</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСрокаГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыИдентификаторовТовараККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыИдентификаторовТовараККТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КодТовараНеРаспознан</Name>
					<Comment>Код товара, который не распознан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеEAN8</Name>
					<Comment>Код товара в формате EAN-8, UPC-E</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеEAN13</Name>
					<Comment>Код товара в формате EAN-13, UPC-A</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеITF14</Name>
					<Comment>Код товара в формате ITF-14</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеDataMatrixGS1</Name>
					<Comment>Код товара в формате GS1 Data Matrix или Data Matrix маркировки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзделияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеЕГАИС2</Name>
					<Comment>Код товара в кодировке ЕГАИС 2.0 в формате PDF417</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеЕГАИС3</Name>
					<Comment>Код товара в кодировке ЕГАИС 3.0 в формате Data Matrix</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/СостоянияКодовМаркировки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбработчикиОбновления

// Отрезает криптохвосты кодов маркировки.
//
// Возвращаемое значение:
//  Булево - Истина, если произошли ошибки в процессе выполнения, Ложь - в противном случае.
//
Функция ОтрезатьКриптохвосты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияКодовМаркировки.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки
	|ГДЕ
	|	СостоянияКодовМаркировки.ЕстьКриптохвост
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЕстьОшибки = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.КодМаркировки.Установить(Выборка.КодМаркировки);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.ЕстьКриптохвост Тогда
				Запись.КодМаркировкиПолный = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(Запись.КодМаркировки);
				Запись.ЕстьКриптохвост = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ЕстьОшибки = Истина;
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Обновление ИБ.Очистка криптохвостов Маркировка товаров'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()
				),
				УровеньЖурналаРегистрации.Ошибка,
				,
				Выборка.ДокументОснование,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ЕстьОшибки;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует таблицу кодов маркировки заданного документа
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица кодов маркировки:
//   * Номенклатура - СправочникСсылка.Номенклатура - номенклатура;
//   * ХарактеристикаНоменклатуры - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика номенклатуры;
//   * КодМаркировки - Строка - код маркировки.
//
Функция ТаблицаКодовМаркировки(ДокументСсылка) Экспорт
	
	ВидДок = ДокументСсылка.Метаданные().Имя;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДокументТовары.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.#ВидДокумента.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументКодыМаркировки.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ДокументКодыМаркировки.КодМаркировки КАК КодМаркировки
	|ПОМЕСТИТЬ ТаблицаКодовМаркировки
	|ИЗ
	|	Документ.#ВидДокумента.КодыМаркировки КАК ДокументКодыМаркировки
	|ГДЕ
	|	ДокументКодыМаркировки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаКодовМаркировки.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКодовМаркировки КАК ТаблицаКодовМаркировки
	|		ПО ТаблицаТоваров.ИдентификаторТовара = ТаблицаКодовМаркировки.ИдентификаторТовара";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ВидДокумента", ВидДок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДобавитьЗаписиВРегистр(
		Ссылка,
		Товары,
		КодыМаркировки,
		Состояние,
		ОписаниеОшибки,
		ДляПечати = Ложь) Экспорт
	
	НаборЗаписей = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОснование.Установить(Ссылка);
	
	Организация = Ссылка.Организация;
	
	НаборЗаписей.Прочитать();
	ТаблицаНабора = НаборЗаписей.Выгрузить();
	
	// Таблица полученных кодов маркировки
	ТаблицаКодовМаркировки = Новый ТаблицаЗначений();
	ТаблицаКодовМаркировки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаКодовМаркировки.Колонки.Добавить(
		"ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаКодовМаркировки.Колонки.Добавить("КодМаркировки", Новый ОписаниеТипов("Строка"));
	
	СимволГруппировки   = МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1();
	СимволЭкранирования = МенеджерОборудованияМаркировкаКлиентСервер.ЭкранированныйСимволGS1();
	
	КодТовараВФорматеDataMatrixGS1 = Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1;
	Если ТипЗнч(КодыМаркировки) = Тип("Массив") Тогда
		
		//СтруктураПоиска = Новый Структура("GTIN,СерийныйНомер");
		УдалениеНеЗагруженных = Новый Массив;
		
		Для Инд = 0 По КодыМаркировки.Количество() - 1 Цикл
			
			ТекущийКодМаркировки = КодыМаркировки[Инд];
			КодыМаркировки[Инд]  = СтрЗаменить(КодыМаркировки[Инд], СимволГруппировки, СимволЭкранирования);
			КодМаркировкиПолный  = КодыМаркировки[Инд];
			КодМаркировки        = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(КодМаркировкиПолный, "", Ложь);
			
			// Найдем номенклатуру по GTIM
			СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(КодМаркировкиПолный);
			Если СтруктураМаркировки.ТипИдентификатораТовара <>
					КодТовараВФорматеDataMatrixGS1 Тогда
				Продолжить;
			КонецЕсли;
			
			// Проверим, что ранее не было записи с таким кодом маркировки
			//ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтруктураМаркировки);
			Если НЕ ТаблицаНабора.Найти(КодМаркировки, "КодМаркировки") = Неопределено Тогда
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС
					+ СтрШаблон(НСтр("ru ='Код маркировки ""%1"" ранее был загружен.'"), ТекущийКодМаркировки);
				УдалениеНеЗагруженных.Добавить(КодМаркировкиПолный);
				Продолжить;
			КонецЕсли;
			
			Номенклатура   = Неопределено;
			Характеристика = Неопределено;
			
			СтрокаТоваров = Товары.Найти(СтруктураМаркировки.GTIN, "GTIN");
			Если СтрокаТоваров <> Неопределено Тогда
				Номенклатура   = СтрокаТоваров.Номенклатура;
				Характеристика = СтрокаТОваров.ХарактеристикаНоменклатуры;
			Иначе
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС
					+ СтрШаблон(
						НСтр("ru  ='Код маркировки ""%1"" не соответствует заказанным по документу. Код маркировки не загружен.'"),
						ТекущийКодМаркировки
					);
				УдалениеНеЗагруженных.Добавить(КодМаркировкиПолный);
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаНабора.Добавить();
			//НоваяСтрока.Период = ТекущаяДатаСеанса();
			НоваяСтрока.ДокументОснование          = Ссылка;
			НоваяСтрока.Организация                = Организация;
			НоваяСтрока.Номенклатура               = Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = Характеристика;
			НоваяСтрока.GTIN                       = СтруктураМаркировки.GTIN;
			НоваяСтрока.СерийныйНомер              = СтруктураМаркировки.СерийныйНомер;
			НоваяСтрока.Состояние                  = Состояние;
			НоваяСтрока.КодМаркировки              = КодМаркировки;
			НоваяСтрока.КодМаркировкиПолный        = КодМаркировкиПолный;
			НоваяСтрока.ЕстьКриптохвост            = Истина;
			
			НоваяСтрока = ТаблицаКодовМаркировки.Добавить();
			НоваяСтрока.Номенклатура               = Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = Характеристика;
			НоваяСтрока.КодМаркировки              = КодМаркировкиПолный;
			
		КонецЦикла;
		
		Для Каждого ТекущаяМаркировка Из УдалениеНеЗагруженных Цикл
			КодыМаркировки.Удалить(КодыМаркировки.Найти(ТекущаяМаркировка));
		КонецЦикла;
		
	Иначе
		СтруктураПоиска = Новый Структура("ИдентификаторТовара");
		Для Каждого ТекущаяСтрока Из Товары Цикл
			СтруктураПоиска.ИдентификаторТовара = ТекущаяСтрока.ИдентификаторТовара;
			НайденныеСтроки = КодыМаркировки.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого ТекущаяМаркировка Из НайденныеСтроки Цикл
				
				// Найдем номенклатуру по GTIM
				СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ТекущаяМаркировка.КодМаркировки);
				
				Если СтруктураМаркировки.ТипИдентификатораТовара <>
					КодТовараВФорматеDataMatrixGS1 Тогда
					Продолжить;
				КонецЕсли;
				
				КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущаяМаркировка.КодМаркировки, "", Ложь);
				
				НоваяСтрока = ТаблицаНабора.Добавить();
				//НоваяСтрока.Период = ТекущаяДатаСеанса();
				НоваяСтрока.ДокументОснование          = Ссылка;
				НоваяСтрока.Организация                = Организация;
				НоваяСтрока.Номенклатура               = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
				НоваяСтрока.GTIN                       = СтруктураМаркировки.GTIN;
				НоваяСтрока.СерийныйНомер              = СтруктураМаркировки.СерийныйНомер;
				НоваяСтрока.Состояние                  = Состояние;
				НоваяСтрока.КодМаркировки              = КодМаркировки;
				НоваяСтрока.КодМаркировкиПолный        = ТекущаяМаркировка.КодМаркировки;
				НоваяСтрока.ЕстьКриптохвост            = Истина;
				
				НоваяСтрока = ТаблицаКодовМаркировки.Добавить();
				НоваяСтрока.Номенклатура               = ТекущаяСтрока.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
				НоваяСтрока.КодМаркировки              = ТекущаяМаркировка.КодМаркировки;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей.Загрузить(ТаблицаНабора);
	НаборЗаписей.Записать();
	
	// Заполним регистр для печати кодов маркировок
	Если ДляПечати И ТаблицаКодовМаркировки.Количество() > 0 Тогда
		МаркировкаТоваровСервер.ДобавитьЗаписиВРегистр(Ссылка, ТаблицаКодовМаркировки);
	КонецЕсли;
	
КонецПроцедуры

Функция КодМаркировкиЗапрещенДляВывода(ТаблицаМаркировок, Организация) Экспорт
	
	Результат = Ложь;
	СписокСостоянийВводаВОборот = Перечисления.СостоянияКодовМаркировки.СостоянияВводаВОборотМаркировки();
	
	ТаблицаРазбораМаркировки = Новый Массив;
	
	КодТовараВФорматеDataMatrixGS1 = Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1;
	// Разберем маркировку на состовляющие для поиска
	Для Каждого ТекущаяСтрока Из ТаблицаМаркировок Цикл
		
		СтруктураМаркировки =
			МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ТекущаяСтрока.КодМаркировки);
		Если СтруктураМаркировки.ТипИдентификатораТовара <>
			КодТовараВФорматеDataMatrixGS1 Тогда
			Продолжить;
		КонецЕсли;
		
		КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущаяСтрока.КодМаркировки, "", Ложь);
		
		ТаблицаРазбораМаркировки.Добавить(КодМаркировки);
		
	КонецЦикла;
	
	// Получим текущие статусы маркировки
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияКодовМаркировки.КодМаркировки КАК КодМаркировки,
	|	СостоянияКодовМаркировки.Организация.ИНН КАК ИННОрганизации,
	|	СостоянияКодовМаркировки.Номенклатура КАК Номенклатура,
	|	СостоянияКодовМаркировки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СостоянияКодовМаркировки.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки
	|ГДЕ
	|	СостоянияКодовМаркировки.КодМаркировки В (&КодыМаркировки)
	|";
	
	Запрос.УстановитьПараметр("СписокКодовМаркировок", ТаблицаРазбораМаркировки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИННОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН");
	Пока Выборка.Следующий() Цикл
		Если ИННОрганизации <> Выборка.ИННОрганизации Тогда
			Если НЕ ЗначениеЗаполнено(Выборка.ХарактеристикаНоменклатуры) Тогда
				ВывестиСообщение(
					НСтр("ru  ='Товар <%1> с маркировкой <%2> принадлежит другой организации.'"),
					,, , ,
					СокрЛП(Выборка.Номенклатура),
					СокрЛП(Выборка.КодМаркировки)
				);
			Иначе
				ВывестиСообщение(
					НСтр("ru  ='Товар <%1> с характеристикой <%2> с маркировкой <%3> принадлежит другой организации.'"),
					,, , ,
					СокрЛП(Выборка.Номенклатура),
					СокрЛП(Выборка.ХарактеристикаНоменклатуры),
					СокрЛП(Выборка.КодМаркировки)
				);
			КонецЕсли;
			Результат = Истина;
		ИначеЕсли СписокСостоянийВводаВОборот.Найти(Выборка.Состояние) = Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(Выборка.ХарактеристикаНоменклатуры) Тогда
				ВывестиСообщение(
					НСтр("ru ='Товар <%1> с маркировкой <%2> не был введен в оборот или был выведен из оборота ранее.'"),
					,, , ,
					СокрЛП(Выборка.Номенклатура),
					СокрЛП(Выборка.КодМаркировки)
				);
			Иначе
				ВывестиСообщение(
					НСтр("ru ='Товар <%1> с характеристикой <%2> с маркировкой <%3> "
					+ "не был введен в оборот или был выведен из оборота ранее.'"),
					,, , ,
					СокрЛП(Выборка.Номенклатура),
					СокрЛП(Выборка.ХарактеристикаНоменклатуры),
					СокрЛП(Выборка.КодМаркировки)
				);
			КонецЕсли;
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция КодМаркировкиВведенВОборот(ТаблицаМаркировок) Экспорт
	
	КодыРанееВведеныВОборот = Ложь;
	
	КодыМаркировки = Новый Массив;
	Для Каждого ТекущаяСтрока Из ТаблицаМаркировок Цикл
		КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущаяСтрока.КодМаркировки, "", Ложь);
		КодыМаркировки.Добавить(КодМаркировки);
	КонецЦикла;
	
	// Проверим, что на текущий момент маркировка не введена в оборот
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияКодовМаркировки.КодМаркировки КАК КодМаркировки,
	|	СостоянияКодовМаркировки.Номенклатура КАК Номенклатура,
	|	СостоянияКодовМаркировки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СостоянияКодовМаркировки.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки
	|ГДЕ
	|	СостоянияКодовМаркировки.КодМаркировки В (&КодыМаркировки) И 
	|	СостоянияКодовМаркировки.Состояние В (&СписокСостоянийВОбороте)
	|";
	
	Запрос.УстановитьПараметр("КодыМаркировки", КодыМаркировки);
	Запрос.УстановитьПараметр("СписокСостоянийВОбороте",
		Перечисления.СостоянияКодовМаркировки.СостоянияВводаВОборотМаркировки());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.ХарактеристикаНоменклатуры) Тогда
			ВывестиСообщение(
				НСтр("ru ='Товар <%1> с маркировкой <%2> введен в оборот ранее.'"),
				, , , ,
				СокрЛП(Выборка.Номенклатура),
				СокрЛП(Выборка.КодМаркировки)
			);
		Иначе
			ВывестиСообщение(
				НСтр("ru ='Товар <%1> с характеристикой <%2> с маркировкой <%3> введен в оборот ранее.'"),
				, , , ,
				СокрЛП(Выборка.Номенклатура),
				СокрЛП(Выборка.ХарактеристикаНоменклатуры),
				СокрЛП(Выборка.КодМаркировки)
			);
		КонецЕсли;
		КодыРанееВведеныВОборот = Истина;
	КонецЦикла;
	
	Возврат КодыРанееВведеныВОборот;
	
КонецФункции

Функция ТекущиеСтатусыКодовМаркировки(СписокКодовМаркировок) Экспорт
	
	// Получим текущие статусы маркировки
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СписокКодовМаркировок.КодМаркировки КАК КодМаркировки
	|ПОМЕСТИТЬ
	|	ТаблицаМаркировок
	|ИЗ
	|	&СписокКодовМаркировок КАК СписокКодовМаркировок
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаМаркировок.КодМаркировки КАК КодМаркировки,
	|	СостоянияКодовМаркировки.Номенклатура КАК Номенклатура,
	|	СостоянияКодовМаркировки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СостоянияКодовМаркировки.Состояние КАК Состояние
	|ИЗ
	|	ТаблицаМаркировок КАК ТаблицаМаркировок
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки
	|ПО
	|	ТаблицаМаркировок.КодМаркировки = СостоянияКодовМаркировки.КодМаркировки
	|";
	Запрос.УстановитьПараметр("СписокКодовМаркировок", СписокКодовМаркировок);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Записывает движения по регистру "Состояния кодов маркировки"
//
// Возвращаемое значение:
//  Булево - Истина, если операция прошла успешно, Ложь - в противном случае.
//
Функция СостояниеКодовМаркировки(ДокументСсылка, Организация, Состояние, РезультатЗапросаПоКодамМаркировки = Неопределено, 
	ПроверятьВыводИзОборота = Ложь, ПроверятьВводВОборот = Ложь, ОчищатьЗаписи = Ложь) Экспорт
	
	ВсеОК = Истина;
	
	Если ТипЗнч(РезультатЗапросаПоКодамМаркировки) = Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоКодамМаркировки = РезультатЗапросаПоКодамМаркировки.Выгрузить();
	ИначеЕсли НЕ ТипЗнч(РезультатЗапросаПоКодамМаркировки) = Тип("ТаблицаЗначений") Тогда
		РезультатЗапросаПоКодамМаркировки = ТаблицаКодовМаркировки(ДокументСсылка);
	КонецЕсли;
	
	Если ПроверятьВыводИзОборота Тогда
		
		КодМаркировкиЗапрещенДляВывода = КодМаркировкиЗапрещенДляВывода(
			РезультатЗапросаПоКодамМаркировки,
			Организация);
		
		Если КодМаркировкиЗапрещенДляВывода Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПроверятьВводВОборот Тогда
		
		КодМаркировкиВведенВОборот = КодМаркировкиВведенВОборот(РезультатЗапросаПоКодамМаркировки);
		
		Если КодМаркировкиВведенВОборот Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	
	КодТовараВФорматеDataMatrixGS1 = Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1;
	Для Каждого ТекущаяСтрока Из РезультатЗапросаПоКодамМаркировки Цикл
		
		СтруктураМаркировки =
			МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ТекущаяСтрока.КодМаркировки);
		Если НЕ СтруктураМаркировки.Разобран Тогда
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Код маркировки <%1> не разобран. Проверьте его корректность.'"),
				СокрЛП(ТекущаяСтрока.КодМаркировки)
			);
			ВывестиСообщение(ТекстСообщения);
			ВсеОК = Ложь;
		КонецЕсли;
		
		Если СтруктураМаркировки.ТипИдентификатораТовара <>
			КодТовараВФорматеDataMatrixGS1 Тогда
			Продолжить;
		КонецЕсли;
		
		КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущаяСтрока.КодМаркировки, "", Ложь);
		
		НаборЗаписей.Отбор.КодМаркировки.Установить(КодМаркировки);
		НаборЗаписей.Прочитать();
		Если ОчищатьЗаписи Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			ОсобенностьУчета = Справочники.Номенклатура.ПолучитьОсобенностьУчета(ТекущаяСтрока.Номенклатура);
			ВидПродукции = Справочники.ОсобенностиУчетаНоменклатуры.ПолучитьВидПродукции(ОсобенностьУчета);
			
			ДанныеРазбора = ШтрихкодированиеМПСервер.РазобратьКодМаркировки(ТекущаяСтрока.КодМаркировки, ВидПродукции);
			
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.Организация       = Организация;
			НоваяСтрока.Номенклатура      = ТекущаяСтрока.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			НоваяСтрока.ЕдиницаИзмерения  = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.Номенклатура, "ОсновнаяЕдиницаИзмерения");
			НоваяСтрока.GTIN              = СтруктураМаркировки.GTIN;
			НоваяСтрока.СерийныйНомер     = СтруктураМаркировки.СерийныйНомер;
			НоваяСтрока.Состояние         = Состояние;
			НоваяСтрока.КодМаркировки     = КодМаркировки;
			НоваяСтрока.ВидУпаковки       = ДанныеРазбора.ВидУпаковки;
			НоваяСтрока.Количество        = 1;
			НоваяСтрока.КодМаркировкиПолный = ТекущаяСтрока.КодМаркировки;
			НоваяСтрока.ЕстьКриптохвост     = Истина;
		Иначе
			НоваяСтрока = НаборЗаписей[0];
			НоваяСтрока.Состояние         = Состояние;
		КонецЕсли;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ВсеОК = Ложь;
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось записать состояние кодов маркировки.'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ВсеОК;
	
КонецФункции // СостояниеКодовМаркировки()

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов.
//  Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#КонецОбласти

#Область Печать

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецОбласти

#КонецОбласти

#КонецЕсли
